app/Helper/Currency.php

function currency(){
    $categories_data = Currency::where('status', '=', '1')->first();
---
select * from `currencies` where `status` = '1' limit 1