app/Http/Controllers/CategoryController.php

select * from `categories` where `parent_id` is null order by `order` asc
---
    public function index()
    {
        $categories_data = Category::where('parent_id', null)->orderby('order', 'asc')->get();