app/Http/Controllers/CustomerController.php

select * from `users` where `utype` = 'CUS' order by `updated_at` asc
---
    public function index()
    {
        $customers_data = User::where('utype', '=', 'CUS')->orderby('updated_at', 'asc')->get();

select * from `users` where `users`.`id` = '2' limit 1
---
    public function show($id)
    {
        $customer = User::find($id);