app/Http/Controllers/DiscountController.php

    public function index()
    {
        $discounts_data = Discount::orderby('updated_at', 'asc')->get();
---
select * from `discounts` order by `updated_at` asc

    public function create()
    {
        $products_data = Product::select('id','name','discount_id', 'price')->whereNull('discount_id')->orderby('updated_at', 'asc')->get();
---
select `id`, `name`, `discount_id`, `price` from `products` where `discount_id` is null order by `updated_at` asc

    public function store(Request $request)
    {

    $status = $request->status;
    $discount = new Discount();

    switch ($status) {
        case 'fit price':

            $product = Product::find($request->fit_product_id);

            $validated = $request->validate([
                'name' => 'required|max:255',
                'status' => 'required|max:255',
                'discount_price' => 'numeric|min:0|max:'.$product->price,
            ]
            ,[
                'name.required' => 'Discount နာမည်ထည့်ပေးရန် လိုအပ်ပါသည်။',
                'status.required' => 'Discount Type ထည့်ပေးရန် လိုအပ်ပါသည်။',
            ]
        );

            // fit Price Discount
            $discount->name = $request->name;
            $discount->description = $request->description;
            $discount->discount_price = $request->discount_price;
            $discount->status = $status;

            $discount->save();

            // Save Product
            $product->discount_id = $discount->id;
            $product->save();
---
select * from `products` where `products`.`id` = '8' limit 1
insert into `discounts` (`name`, `description`, `discount_price`, `status`, `updated_at`, `created_at`) values ('Discount 1', 'test', '900', 'fit price', '2022-07-07 16:53:33', '2022-07-07 16:53:33')
update `products` set `discount_id` = 13, `products`.`updated_at` = '2022-07-07 16:53:33' where `id` = 8

            $discount->discount_percent = $request->discount_percent;
            $discount->status = $status;

            $discount->save();

            foreach ($request->percentage_product_id as $value) {
                $product = Product::find($value);
                $product->discount_id = $discount->id;
                $product->save();
---
insert into `discounts` (`name`, `description`, `discount_percent`, `status`, `updated_at`, `created_at`) values ('Discount 5', 'test', '20', 'percentage price', '2022-07-07 18:27:39', '2022-07-07 18:27:39')
select * from `products` where `products`.`id` = '14' limit 1
update `products` set `discount_id` = 17, `products`.`updated_at` = '2022-07-07 18:27:39' where `id` = 14

            $discount->status = $status;


            $discount->save();

            $product = Product::find($request->gif_single_product_id);
            $product->discount_id = $discount->id;
            $product->save();
---
insert into `discounts` (`name`, `description`, `gif_products_id`, `status`, `updated_at`, `created_at`) values ('Discount 2', 'test', '14', 'free gif', '2022-07-07 17:17:11', '2022-07-07 17:17:11')
select * from `products` where `products`.`id` = '9' limit 1
update `products` set `discount_id` = 14, `products`.`updated_at` = '2022-07-07 17:17:11' where `id` = 9

            $discount->name = $request->name;
            $discount->description = $request->description;
            $discount->status = $status;
            $discount->save();

            foreach ($request->free_ship_products_id as $value) {
                $product = Product::find($value);
                $product->discount_id = $discount->id;
                $product->save();
---
insert into `discounts` (`name`, `description`, `status`, `updated_at`, `created_at`) values ('Discount 3', 'teset', 'free shipping', '2022-07-07 17:19:11', '2022-07-07 17:19:11')
select * from `products` where `products`.`id` = '12' limit 1
update `products` set `discount_id` = 15, `products`.`updated_at` = '2022-07-07 17:19:11' where `id` = 12

            $discount->status = $status;


            $discount->save();

            $product = Product::find($request->get_one_product_id);
            $product->discount_id = $discount->id;
            $product->save();
---
insert into `discounts` (`name`, `description`, `status`, `updated_at`, `created_at`) values ('Discount 4', 'test', 'buy one get one', '2022-07-07 17:19:37', '2022-07-07 17:19:37')
select * from `products` where `products`.`id` = '15' limit 1
update `products` set `discount_id` = 16, `products`.`updated_at` = '2022-07-07 17:19:37' where `id` = 15

    public function edit(Discount $discount)
    {
        $products_data = Product::select('id','name','discount_id', 'price')->whereNull('discount_id')->orderby('updated_at', 'asc')->get();
---
select `id`, `name`, `discount_id`, `price` from `products` where `discount_id` is null order by `updated_at` asc

    public function update(Request $request, Discount $discount)
    {

        $status = $request->status;

        foreach ($discount->products as $value) {
            $product = Product::find($value->id);
            $product->discount_id = NULL;
            $product->save();
        }

        switch ($status) {
            case 'fit price':

                $product = Product::find($request->fit_product_id);
---
select * from `products` where `products`.`id` = 8 limit 1
update `products` set `discount_id` = '', `products`.`updated_at` = '2022-07-07 16:54:35' where `id` = 8
select * from `products` where `products`.`id` = '18' limit 1

                $discount->description = $request->description;
                $discount->discount_price = $request->discount_price;

                $discount->save();

                // Save Product
                $product->discount_id = $discount->id;
                $product->save();
---
update `discounts` set `discount_price` = '120000', `discounts`.`updated_at` = '2022-07-07 16:54:35' where `id` = 13
update `products` set `discount_id` = 13, `products`.`updated_at` = '2022-07-07 16:54:35' where `id` = 18