app/Http/Controllers/FrontendController.php

select * from `products` order by `updated_at` desc limit 9
---
    public function index(){
        $latest_products = Product::orderby('updated_at', 'desc')->limit(8)->get();
        $featured_products = Product::orderby('updated_at', 'desc')->limit(9)->get();

select * from `products` order by `updated_at` desc limit 9 offset 0
select count(*) as aggregate from `products`
select * from `products` order by `updated_at` desc limit 3
select * from `categories` where `parent_id` is null order by `order` asc
---
    public function shop(){
        $products = Product::orderby('updated_at', 'desc')->paginate(9);
        $featured_products = Product::orderby('updated_at', 'desc')->limit(3)->get();
        $categories_data = Category::where('parent_id', NULL)->orderby('order', 'asc')->get();

select * from `products` where `permalink` = 'digital-stethoscope' limit 1
select * from `products` where `category_id` = 10 order by `updated_at` desc limit 9 offset 0
---
    public function shopDetail($permalink){
        $product = Product::where('permalink', $permalink)->first();
        $category_products = Product::where('category_id', '=', $product->category->id)
                    ->orderby('updated_at', 'desc')->limit(9)->get();

select * from `categories` where `permalink` = 'hand-sanitizer' limit 1
select * from `products` where `category_id` = 9 order by `updated_at` desc limit 9 offset 0
select count(*) as aggregate from `products` where `category_id` = 9
select * from `products` order by `updated_at` desc limit 3
select * from `categories` where `parent_id` is null order by `order` asc
---
    public function categoryItem($permalink){
        $category = Category::where('permalink', $permalink)->first();
        // $products = $category->products()->orderby('updated_at', 'desc')->paginate(9);
        $products = Product::where('category_id', '=', $category->id)
                    ->orderby('updated_at', 'desc')->paginate(9);

        $featured_products = Product::orderby('updated_at', 'desc')->limit(3)->get();
        $categories_data = Category::where('parent_id', NULL)->orderby('order', 'asc')->get();

select * from `products` where `products`.`id` = '9' limit 1
---
    public function addToCart($id)

    {

        $product = Product::findOrFail($id);

select * from `products` where `products`.`id` = '8' limit 1
---
    public function buyNow($id)

    {

        $product = Product::findOrFail($id);

select * from `products`
---
    public function checkout()
    {
        $products = Product::all();