app/Http/Controllers/OrderController.php

select * from `orders`
---
    public function index()
    {
        $orders_data = Order::all();