app/Http/Controllers/ProductController.php

    public function index()
    {
        $products_data = Product::select('id','name','permalink','asset','price','status','category_id','inventory_id','discount_id','user_id')->where('status', '=', '1')->orderby('updated_at', 'asc')->get();
---
select `id`, `name`, `permalink`, `asset`, `price`, `status`, `category_id`, `inventory_id`, `discount_id`, `user_id` from `products` where `status` = '1' order by `updated_at` asc